blog/WellFoundedRecursion.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-04-01 Wed 18:50 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>An exploration of well-founded recursion</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mark Armstrong" />
<meta name="description" content="Exploring definitions using well-founded recursion in Agda."
 />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">An exploration of well-founded recursion</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#Introduction">1. Introduction</a></li>
<li><a href="#Agda-header">2. Agda header</a></li>
<li><a href="#Problem-1-–-The-Euclidean-algorithm">3. Problem 1 – The Euclidean algorithm</a>
<ul>
<li><a href="#Preamble">3.1. Preamble</a></li>
<li><a href="#Solution-version-1-–-Defining-our-own-notion-of-well-foundedness">3.2. Solution version 1 – Defining our own notion of well-foundedness</a></li>
<li><a href="#Solution-version-2-–-Using-the-standard-library's-definitions">3.3. Solution version 2 – Using the standard library's definitions</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org5edeaeb" class="outline-2">
<h2 id="Introduction"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-Introduction">
<p>
Using well-founded relations to assist the termination checker
of Agda is something I have always meant to investigate,
but never quite gotten around to.
This post attempts to rectify that.
</p>

<p>
First, I must give credit to the example code posted
by <a href="https://github.com/sergei-romanenko/agda-samples/blob/master/08-WellFounded.agda">Sergei Romanenko</a>,
which explores the technique using a <code>log₂</code> algorithm.
</p>
</div>
</div>

<div id="outline-container-org9d85fba" class="outline-2">
<h2 id="Agda-header"><span class="section-number-2">2</span> Agda header</h2>
<div class="outline-text-2" id="text-Agda-header">
<p>
We use several facts about natural numbers, specfically
regarding <code>&lt;</code> and <code>≤</code> (from which <code>&lt;</code> is derived) below.
</p>
<div class="org-src-container">
<pre class="src src-agda2">module WellFoundedRecursion where

open import Data.Nat
  using <span style="color: #90d800;">(</span> &#8469; ; zero ; suc
        ; _+_ ; _&#8760;_ ; _&#8852;_
        ; _&#8804;_ ; _&lt;_ ; z&#8804;n ; s&#8804;s
        ; _&#8804;&#8242;_ ; _&lt;&#8242;_ ; &#8804;&#8242;-refl ; &#8804;&#8242;-step<span style="color: #90d800;">)</span>
open import Data.Nat.Properties
  using <span style="color: #90d800;">(</span> &lt;-cmp ; &#8804;-step ; &#8804;-refl ; &lt;-trans&#737; ; &#8804;&#8658;&#8804;&#8242;
        ; m&#8760;n&#8804;m<span style="color: #90d800;">)</span>

open import Relation.Binary.Definitions using <span style="color: #90d800;">(</span>tri&lt; ; tri&#8776; ; tri&gt;<span style="color: #90d800;">)</span>
open import Relation.Binary.PropositionalEquality using <span style="color: #90d800;">(</span>_&#8801;_ ; refl<span style="color: #90d800;">)</span>

open import Function using <span style="color: #90d800;">(</span>case_of_<span style="color: #90d800;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgaa76f9c" class="outline-2">
<h2 id="Problem-1-–-The-Euclidean-algorithm"><span class="section-number-2">3</span> Problem 1 – The Euclidean algorithm</h2>
<div class="outline-text-2" id="text-Problem-1-–-The-Euclidean-algorithm">
</div>

<div id="outline-container-org5564f80" class="outline-3">
<h3 id="Preamble"><span class="section-number-3">3.1</span> Preamble</h3>
<div class="outline-text-3" id="text-Preamble">
<p>
Euclid's GCD is a well known and elegantly simple algorithm.
It hinges upon the fact that
given natural numbers <code>m</code> and <code>n</code> with <code>m &lt; n</code>, <code>GCD(m,n) = GCD(m,n-m)</code>.
Note also that if <code>m = n</code>, then <code>GCD(m,n) = m = n</code>,
and if <code>n = 0</code>, then <code>GCD(m,n) = m</code>.
</p>

<p>
Making use of the three-way comparison function <code>&lt;-cmp</code>,
we can easily transcribe this algorithm into Agda.
</p>
<div class="org-src-container">
<pre class="src src-agda2">module WithoutWFR where
  
  <span style="color: #a8a8a8;">{-# TERMINATING #-}</span>
  EuclidGCD : &#8469; &#8594; &#8469; &#8594; &#8469;
  EuclidGCD zero      m         = m
  EuclidGCD n@<span style="color: #90d800;">(</span>suc _<span style="color: #90d800;">)</span> zero      = n
  EuclidGCD n@<span style="color: #90d800;">(</span>suc _<span style="color: #90d800;">)</span> m@<span style="color: #90d800;">(</span>suc _<span style="color: #90d800;">)</span> =
    case &lt;-cmp n m of
      &#955; <span style="color: #90d800;">{</span> <span style="color: #b6a0ff;">(</span>tri&lt; _ _ _<span style="color: #b6a0ff;">)</span> &#8594; EuclidGCD n <span style="color: #b6a0ff;">(</span>m &#8760; n<span style="color: #b6a0ff;">)</span>
        ; <span style="color: #b6a0ff;">(</span>tri&#8776; _ _ _<span style="color: #b6a0ff;">)</span> &#8594; m
        ; <span style="color: #b6a0ff;">(</span>tri&gt; _ _ _<span style="color: #b6a0ff;">)</span> &#8594; EuclidGCD <span style="color: #b6a0ff;">(</span>n &#8760; m<span style="color: #b6a0ff;">)</span> m
        <span style="color: #90d800;">}</span>
</pre>
</div>
<p>
But Agda will not believe this is terminating, because it fails to see
in the recursive case that <code>m ∸ n</code>/~n ∸ m~ are
structurally smaller than <code>m</code> or <code>n</code>.
</p>

<p>
Note that the use of the <code>TERMINATING</code> pragma does allow us to
use <code>EuclidGCD</code>; unlike the <code>NONTERMINATING</code> pragma, which
would prevent Agda from normalising uses of <code>EuclidGCD</code>.
</p>
<div class="org-src-container">
<pre class="src src-agda2">  _ : EuclidGCD 12 20 &#8801; 4
  _ = refl
</pre>
</div>
<p>
But it is ultimately against the spirit of verified programming in Agda
to use this “just believe me” approach.
</p>


<p>
This is understandable; we must apply the proofs
of <code>m &lt; n</code> or <code>n &lt; m</code> in order to establish those facts.
If we try to state that using <code>_&lt;_</code>, we get stuck in the base cases
during the proof.
</p>
<pre class="example">
m∸n&lt;m : {m n : ℕ} → m ∸ n &lt; m
m∸n&lt;m {m} {zero} = ??? -- Stuck; m ≮ n
m∸n&lt;m {zero} {suc n} = ??? -- Stuck ; zero ≮ zero
m∸n&lt;m {suc m} {suc n} =
  &lt;-transˡ (m∸n&lt;m {m} {n}) -- suc m ∸ suc n = m ∸ n &lt; m, by I.H.
          (≤-step ≤-refl) -- and m ≤ suc m.
</pre>

<p>
To actually prove this,
we must know that both <code>m</code> and <code>n</code> are non-zero
—then we may use the fact
that <code>m ∸ n</code> is <i>less than or equal to</i> to <code>m</code>,
the proof of which is in the standard library and is very close
to our attempted proof above for <code>_&lt;_</code>.
</p>
<div class="org-src-container">
<pre class="src src-agda2">Sm&#8760;Sn&lt;Sm : <span style="color: #90d800;">(</span>m n : &#8469;<span style="color: #90d800;">)</span> &#8594; suc m &#8760; suc n &lt; suc m
Sm&#8760;Sn&lt;Sm m n = s&#8804;s <span style="color: #90d800;">(</span>m&#8760;n&#8804;m m n<span style="color: #90d800;">)</span>
</pre>
</div>

<p>
With this proof in hand, we are equipped to use a well-founded relation
to rework our <code>EuclidGCD</code> function so that it passes the termination checker.
We start by defining the concepts ourselves,
then we will utilise the (level-agnostic) versions from the standard library.
</p>
</div>
</div>

<div id="outline-container-orgcf4be0a" class="outline-3">
<h3 id="Solution-version-1-–-Defining-our-own-notion-of-well-foundedness"><span class="section-number-3">3.2</span> Solution version 1 – Defining our own notion of well-foundedness</h3>
<div class="outline-text-3" id="text-Solution-version-1-–-Defining-our-own-notion-of-well-foundedness">
<div class="org-src-container">
<pre class="src src-agda2">module definingWFR where
</pre>
</div>

<p>
We begin with the concept of <i>accessibility</i>. An element <code>x</code> of <code>A</code> is
accessible by relation <code>_&lt;_</code> iff every <code>y</code> such that <code>y &lt; x</code> is accessible.
</p>
<div class="org-src-container">
<pre class="src src-agda2">    data Acc <span style="color: #90d800;">{</span>A : Set<span style="color: #90d800;">}</span> <span style="color: #90d800;">(</span>_&lt;_ : A &#8594; A &#8594; Set<span style="color: #90d800;">)</span> <span style="color: #90d800;">(</span>x : A<span style="color: #90d800;">)</span> : Set where
      acc : <span style="color: #90d800;">(</span>rs : <span style="color: #b6a0ff;">(</span>y : A<span style="color: #b6a0ff;">)</span> &#8594; y &lt; x &#8594; Acc _&lt;_ y<span style="color: #90d800;">)</span> &#8594; Acc _&lt;_ x
</pre>
</div>
<p>
I'm honestly not quite certain of the reasoning behind
the name <code>rs</code>; I interpret it as “Recurse on Smaller”.
This is motivated by the standard library description of
the type of <code>rs</code>:
</p>
<blockquote>
<p>
When using well-founded recursion you can recurse arbitrarily, as
long as the arguments become smaller, and “smaller” is
well-founded.
</p>
</blockquote>

<p>
The standard library “extracts” that type. It is the type of
“well-founded recursion”; we do the same here.
</p>
<div class="org-src-container">
<pre class="src src-agda2">  WfRec : <span style="color: #90d800;">{</span>A : Set<span style="color: #90d800;">}</span> &#8594; <span style="color: #90d800;">(</span>A &#8594; A &#8594; Set<span style="color: #90d800;">)</span> &#8594; <span style="color: #90d800;">(</span>A &#8594; Set<span style="color: #90d800;">)</span> &#8594; A &#8594; Set
  WfRec <span style="color: #90d800;">{</span>A<span style="color: #90d800;">}</span> _&lt;_ P x = <span style="color: #90d800;">{</span>y : A<span style="color: #90d800;">}</span> &#8594; y &lt; x &#8594; P y
</pre>
</div>
<p>
Then the above definition is shortened to
</p>
<div class="org-src-container">
<pre class="src src-agda2">  data Acc <span style="color: #90d800;">{</span>A : Set<span style="color: #90d800;">}</span> <span style="color: #90d800;">(</span>_&lt;_ : A &#8594; A &#8594; Set<span style="color: #90d800;">)</span> <span style="color: #90d800;">(</span>x : A<span style="color: #90d800;">)</span> : Set where
    acc : <span style="color: #90d800;">(</span>rs : WfRec _&lt;_ <span style="color: #b6a0ff;">(</span>Acc _&lt;_<span style="color: #b6a0ff;">)</span> x<span style="color: #90d800;">)</span> &#8594; Acc _&lt;_ x
</pre>
</div>

<p>
A relation is well-founded if all elements
of the underlying set are accessible;
that is, we will need to prove that for every <code>x : A</code>,
every <code>y &lt; x</code> is accessible to
be able to call <code>_&lt;_</code> well founded.
</p>
<div class="org-src-container">
<pre class="src src-agda2">  Well-founded : <span style="color: #90d800;">{</span>A : Set<span style="color: #90d800;">}</span> &#8594; <span style="color: #90d800;">(</span>A &#8594; A &#8594; Set<span style="color: #90d800;">)</span> &#8594; Set
  Well-founded <span style="color: #90d800;">{</span>A<span style="color: #90d800;">}</span> _&lt;_ = <span style="color: #90d800;">(</span>x : A<span style="color: #90d800;">)</span> &#8594; Acc _&lt;_ x
</pre>
</div>

<p>
Let us prove that less than on the naturals is well-founded.
We use an alternate version of less from the standard library
defined using reflexivity and “step” as constructors,
which the standard library describes as
</p>
<blockquote>
<p>
more suitable for well-founded induction (see Induction.Nat).
</p>
</blockquote>
<p>
I did not manage to complete the proof using <code>_&lt;_</code> before turning
to this <code>_&lt;′_</code>.
</p>
<div class="org-src-container">
<pre class="src src-agda2">  &lt;&#8242;-acc : <span style="color: #90d800;">{</span>x y : &#8469;<span style="color: #90d800;">}</span> &#8594; y &lt;&#8242; x &#8594; Acc _&lt;&#8242;_ y
  &lt;&#8242;-acc .<span style="color: #90d800;">{</span>suc y<span style="color: #90d800;">}</span> <span style="color: #90d800;">{</span>y<span style="color: #90d800;">}</span> &#8804;&#8242;-refl = acc &lt;&#8242;-acc
  &lt;&#8242;-acc <span style="color: #90d800;">(</span>&#8804;&#8242;-step <span style="color: #b6a0ff;">{</span>_<span style="color: #b6a0ff;">}</span> y&lt;&#8242;x<span style="color: #90d800;">)</span> = &lt;&#8242;-acc y&lt;&#8242;x

  &lt;&#8242;-well-founded : Well-founded _&lt;&#8242;_
  &lt;&#8242;-well-founded n = acc &lt;&#8242;-acc
</pre>
</div>
<p>
Since the right side of the base case of <code>&lt;′-acc</code> is
exactly <code>&lt;′-well-founded</code>, I've seen these presented as
mutual definitions; I find it more illuminating to
detangle them.
</p>

<p>
Now, to define the Euclidean algorithm function,
we must decide upon a value upon which to base our well-founded recursion
with respect to <code>_&lt;_</code>. That is, we must decide upon a value
which is strictly decreasing at each call.
However, we are only decreasing one of the two arguments at each call,
and it is not necessarily the same argument each time.
So neither <code>m</code> or <code>n</code> is an adequate choice.
Instead, we may consider the <i>maximum</i> of the two, <code>m ⊔ n</code>,
which does always decrease, since we monus a non-zero value
from the greater of the two arguments at each call.
This does require some lemmas regarding <code>_⊔_</code>.
</p>
<div class="org-src-container">
<pre class="src src-agda2">  open import Data.Nat.Properties
    using <span style="color: #90d800;">(</span>m&lt;n&#8658;m&lt;n&#8852;o ; m&lt;n&#8658;m&lt;o&#8852;n ; &#8852;-pres-&lt;m<span style="color: #90d800;">)</span>

  EuclidGCD&#8242; : <span style="color: #90d800;">(</span>m n : &#8469;<span style="color: #90d800;">)</span> &#8594; Acc _&lt;&#8242;_ <span style="color: #90d800;">(</span>m &#8852; n<span style="color: #90d800;">)</span> &#8594; &#8469;
  EuclidGCD&#8242; zero m _ = m
  EuclidGCD&#8242; n@<span style="color: #90d800;">(</span>suc _<span style="color: #90d800;">)</span> zero _ = n
  EuclidGCD&#8242; m@<span style="color: #90d800;">(</span>suc m&#8320;<span style="color: #90d800;">)</span> n@<span style="color: #90d800;">(</span>suc n&#8320;<span style="color: #90d800;">)</span> <span style="color: #90d800;">(</span>acc rs<span style="color: #90d800;">)</span> =
    case &lt;-cmp m n of
      &#955; <span style="color: #90d800;">{</span> <span style="color: #b6a0ff;">(</span>tri&lt; m&lt;n _ _<span style="color: #b6a0ff;">)</span> &#8594;
          EuclidGCD&#8242; m <span style="color: #b6a0ff;">(</span>n &#8760; m<span style="color: #b6a0ff;">)</span>
                     <span style="color: #b6a0ff;">(</span>rs <span style="color: #6ae4b9;">{</span>suc m&#8320; &#8852; <span style="color: #f0ce43;">(</span>n&#8320; &#8760; m&#8320;<span style="color: #f0ce43;">)</span><span style="color: #6ae4b9;">}</span>
                         <span style="color: #6ae4b9;">(</span>&#8804;&#8658;&#8804;&#8242; <span style="color: #f0ce43;">(</span>m&lt;n&#8658;m&lt;o&#8852;n m <span style="color: #00baf4;">(</span>&#8852;-pres-&lt;m m&lt;n <span style="color: #58dd13;">(</span>Sm&#8760;Sn&lt;Sm n&#8320; m&#8320;<span style="color: #58dd13;">)</span><span style="color: #00baf4;">)</span><span style="color: #f0ce43;">)</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span>
        ; <span style="color: #b6a0ff;">(</span>tri&#8776; _ _ _<span style="color: #b6a0ff;">)</span>   &#8594; m
        ; <span style="color: #b6a0ff;">(</span>tri&gt; _ _ n&lt;m<span style="color: #b6a0ff;">)</span> &#8594;
          EuclidGCD&#8242; <span style="color: #b6a0ff;">(</span>m &#8760; n<span style="color: #b6a0ff;">)</span> n
                     <span style="color: #b6a0ff;">(</span>rs <span style="color: #6ae4b9;">{</span>m&#8320; &#8760; n&#8320; &#8852; suc n&#8320;<span style="color: #6ae4b9;">}</span>
                         <span style="color: #6ae4b9;">(</span>&#8804;&#8658;&#8804;&#8242; <span style="color: #f0ce43;">(</span>m&lt;n&#8658;m&lt;n&#8852;o n <span style="color: #00baf4;">(</span>&#8852;-pres-&lt;m <span style="color: #58dd13;">(</span>Sm&#8760;Sn&lt;Sm m&#8320; n&#8320;<span style="color: #58dd13;">)</span> n&lt;m<span style="color: #00baf4;">)</span><span style="color: #f0ce43;">)</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span>
        <span style="color: #90d800;">}</span>
</pre>
</div>
<p>
In the recursive cases, <code>rs</code> has the type
</p>
<pre class="example">
{y : ℕ} → suc y ≤′ suc (m₀ ⊔ n₀) → Acc (λ m₁ n₁ → suc m₁ ≤′ n₁) y
</pre>
<p>
We've written the implicit argument in in each use
(although Agda doesn't need it to be given)
for clarity.
</p>

<p>
Now, we can define a “clean” version of the Euclidean algorithm function
by utilising our proof that <code>_&lt;′_</code> is well-founded.
</p>
<div class="org-src-container">
<pre class="src src-agda2">  EuclidGCD : <span style="color: #90d800;">(</span>m n : &#8469;<span style="color: #90d800;">)</span> &#8594; &#8469;
  EuclidGCD m n = EuclidGCD&#8242; m n <span style="color: #90d800;">(</span>&lt;&#8242;-well-founded <span style="color: #b6a0ff;">(</span>m &#8852; n<span style="color: #b6a0ff;">)</span><span style="color: #90d800;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf6467e5" class="outline-3">
<h3 id="Solution-version-2-–-Using-the-standard-library's-definitions"><span class="section-number-3">3.3</span> Solution version 2 – Using the standard library's definitions</h3>
<div class="outline-text-3" id="text-Solution-version-2-–-Using-the-standard-library's-definitions">
<p>
:TODO:
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Mark Armstrong</p>
     <p class="author">Contact: <a href="mailto:markparmstrong@gmail.com">markparmstrong@gmail.com</a></p>
     <p class="date">Original date: April 1st, 2020</p>
     <p class="date">Last updated: 2020-04-01 Wed 18:49</p>
     <p class="creator">Created using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.0.90 (<a href="https://orgmode.org">Org</a> mode 9.3.6)</p>
     <p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
